Repository: SynopticAI/SynopticFrontendLite
Catalog: lib/l10n/app_*.arb
Languages: de

# appTitle
source: Device Manager
de: Geräteverwaltung

# deviceConfigurationTitle
source: Device Configuration
de: Gerätekonfiguration

source: Not configured
de: Nicht konfiguriert

source: Untrained
de: Untrainiert

source: Untrained - Need Data
de: Untrainiert - Daten erforderlich

source: Operational
de: Betriebsbereit

source: Busy - Training
de: Beschäftigt - Training

source: Busy - Testing
de: Beschäftigt - Test

source: Error
de: Fehler

source: Device Name
de: Gerätename

source: Task Description
de: Aufgabenbeschreibung

source: Model Type
de: Modelltyp

source: Binary Classification
de: Binäre Klassifikation

source: General Classification
de: Allgemeine Klassifikation

source: Model Settings
de: Modelleinstellungen

source: Training Data Gallery
de: Trainingsdaten-Galerie

source: Test Data Gallery
de: Testdaten-Galerie

source: Configuration
de: Konfiguration

source: Camera Setup
de: Kameraeinrichtung

source: Data Management
de: Datenverwaltung

source: AI Assistant
de: KI-Assistent

source: Start Chat
de: Chat starten

source: Add New Device
de: Neues Gerät hinzufügen

source: Enter device name
de: Gerätename eingeben

source: Cancel
de: Abbrechen

source: Connect
de: Verbinden

source: Add
de: Hinzufügen

source: Delete
de: Löschen

source: Save
de: Speichern

source: Done
de: Fertig

source: Please fill in all fields
de: Bitte alle Felder füllen

# needHelpConfiguring
source: Need help configuring your device? I can assist you with:
de: Benötigen Sie Hilfe bei der Konfiguration? Ich kann Ihnen helfen bei:

# settingUpCamera
source: Setting up camera parameters
de: Einrichten der Kameraparameter

# choosingModelType
source: Choosing the right model type
de: Auswahl des richtigen Modelltyps

# understandingData
source: Understanding data requirements
de: Verständnis der Datenanforderungen

# configuringActions
source: Configuring actions and notifications
de: Konfigurieren von Aktionen und Benachrichtigungen

source: Logout
de: Abmelden

source: Login
de: Anmelden

source: Register
de: Registrieren

source: Password
de: Passwort

# confirmSettings
source: Save Settings
de: Einstellungen speichern

# errorOccurred
source: An error occurred: {error}
de: Ein Fehler ist aufgetreten: {error}

# testingAction
source: testing
de: Test

# statusNotConfigured
source: Please configure your device before {action}
de: Bitte konfigurieren Sie Ihr Gerät vor dem {action}

# statusUntrained
source: Ready to start training
de: Bereit zum Starten des Trainings

# statusNeedData
source: Please upload at least 10 training images before {action}
de: Bitte laden Sie mindestens 10 Trainingsbilder vor dem {action} hoch

# statusOperational
source: Model is trained and ready for testing
de: Modell ist trainiert und bereit für Tests

# statusBusyTraining
source: Model is currently being trained. Please wait
de: Modell wird derzeit trainiert. Bitte warten

# statusBusyTesting
source: Model evaluation is in progress. Please wait
de: Modellevaluierung läuft. Bitte warten

# statusError
source: An error occurred. Please try again
de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es erneut

# statusBusy
source: Please Wait: {status}
de: Bitte warten: {status}

# statusDefault
source: Unable to perform {action} in current state
de: {action} im aktuellen Zustand nicht möglich

source: Busy - Uploading
de: Beschäftigt - Hochladen

# statusBusyUploading
source: Files are currently being uploaded. Please wait.
de: Dateien werden derzeit hochgeladen. Bitte warten.

# addDeviceTitle
source: Add New Device
de: Neues Gerät hinzufügen

# addDeviceEnterName
source: Enter device name
de: Gerätename eingeben

# logoutConfirmTitle
source: Logout
de: Abmelden

# logoutConfirmMessage
source: Are you sure you want to log out?
de: Sind Sie sicher, dass Sie sich abmelden möchten?

source: No task description
de: Keine Aufgabenbeschreibung

source: User not logged in
de: Benutzer nicht angemeldet

# uploadProgressTitle
source: Uploading {count} Images
de: Lade {count} Bilder hoch

# uploadProgressPercent
source: {percent}% complete
de: {percent}% abgeschlossen

source: Upload Complete
de: Upload abgeschlossen

source: Upload Failed
de: Upload fehlgeschlagen

# uploadSuccessMessage
source: Files uploaded successfully
de: Dateien erfolgreich hochgeladen

# uploadFailedMessage
source: Failed to upload files
de: Fehler beim Hochladen der Dateien

# trainingProgressTitle
source: Training Progress
de: Trainingsfortschritt

# trainingCompleteTitle
source: Training Complete
de: Training abgeschlossen

# trainingAccuracyMessage
source: Model achieved {accuracy}% accuracy
de: Modell erreichte {accuracy}% Genauigkeit

# trainingErrorTitle
source: Training Error
de: Trainingsfehler

# trainingErrorMessage
source: Error during training: {error}
de: Fehler während des Trainings: {error}

# actionRequiredTitle
source: Action Required
de: Aktion erforderlich

# classDetectedMessage
source: Class {className} detected with {confidence}% confidence
de: Klasse {className} mit {confidence}% Konfidenz erkannt

source: Setup Progress
de: Einrichtungsfortschritt

# deviceConfigPageTitle
source: Device Configuration
de: Gerätekonfiguration

# deviceConfigPageAiAssistant
source: AI Assistant
de: KI-Assistent

# deviceConfigPageAiAssistantHelp
source: Need help configuring your device? I can assist you with:
de: Brauchen Sie Hilfe bei der Einrichtung Ihres Geräts? Ich kann Sie unterstützen bei:

# deviceConfigPageCameraParams
source: Setting up camera parameters
de: Kameraeinstellungen konfigurieren

# deviceConfigPageModelType
source: Choosing the right model type
de: Den richtigen Modelltyp auswählen

# deviceConfigPageDataRequirements
source: Understanding data requirements
de: Datenanforderungen verstehen

# deviceConfigPageActionsNotifications
source: Configuring actions and notifications
de: Aktionen und Benachrichtigungen

# deviceConfigPageStartChat
source: Start Chat
de: Chat starten

# deviceConfigPageCameraSetup
source: Camera Setup
de: Kameraeinstellungen

# deviceConfigPageConfiguration
source: Configuration
de: Konfiguration

# deviceConfigPageDeviceName
source: Device Name
de: Gerätename

# deviceConfigPageTaskDescription
source: Task Description
de: Aufgabenbeschreibung

# deviceConfigPageWarning
source: Warning
de: Warnung

# deviceConfigPageModelTypeWarning
source: Changing the model type will reset all labels to 0.0. Do you want to proceed?
de: Das Ändern des Modelltyps setzt alle Labels auf 0.0 zurück. Möchten Sie fortfahren?

# deviceConfigPageCancel
source: Cancel
de: Abbrechen

# deviceConfigPageProceed
source: Proceed
de: Fortfahren

# deviceConfigPageSelectModelType
source: Select Model Type
de: Modelltyp auswählen

# deviceConfigPageClassification
source: Classification
de: Klassifikation

# deviceConfigPageModelSettings
source: Model Settings
de: Modelleinstellungen

# deviceConfigPageDataManagement
source: Data Management
de: Datenverwaltung

# deviceConfigPageTrainingDataGallery
source: Training Data Gallery
de: Trainingsdaten-Galerie

# deviceConfigPageTestDataGallery
source: Test Data Gallery
de: Testdaten-Galerie

# deviceConfigPageDeleteDevice
source: Delete Device
de: Gerät löschen

# deviceConfigPageNoDescription
source: No description
de: Keine Beschreibung

# deviceConfigPageErrorUpdatingModelType
source: Error updating model type: {error}
de: Fehler beim Aktualisieren des Modelltyps: {error}

# deviceConfigPageErrorDeletingDevice
source: Error deleting device: {error}
de: Fehler beim Löschen des Geräts: {error}

# deviceConfigPageDeviceNotFound
source: Device not found
de: Gerät nicht gefunden

# deviceConfigPageCannotDelete
source: Cannot delete device while operations are in progress
de: Gerät kann nicht gelöscht werden, während Vorgänge laufen

# deviceConfigPageDeleteConfirmationTitle
source: Delete Device
de: Gerät löschen

# deviceConfigPageDeleteConfirmationContent
source: Are you sure you want to delete this device? This will permanently delete all data, images, and settings. This action cannot be undone.
de: Möchten Sie dieses Gerät wirklich löschen? Dadurch werden alle Daten, Bilder und Einstellungen dauerhaft gelöscht. Diese Aktion kann nicht rückgängig gemacht werden.

# deviceDashboardPageLatestOutput
source: Latest Output
de: Neueste Ausgabe

# deviceDashboardPageConfidence
source: Confidence: {confidence}%
de: Vertrauen: {confidence}%

# deviceDashboardPageConsecutiveOccurrences
source: Consecutive occurrences: {count}
de: Aufeinanderfolgende Vorkommen: {count}

# deviceDashboardPageOutputHistory
source: Output History
de: Ausgabeverlauf

# deviceDashboardPageLatestImage
source: Latest Image
de: Neuestes Bild

# deviceDashboardPageOutputDistribution
source: Output Distribution
de: Ausgabeverteilung

# deviceDashboardPageToday
source: Today
de: Heute

# deviceDashboardPageLast7Days
source: Last 7 Days
de: Letzte 7 Tage

# deviceDashboardPageAllTime
source: All Time
de: Alle Zeiten

# deviceDashboardPageNoOutputData
source: No output data available
de: Keine Ausgabedaten verfügbar

# deviceDashboardPageNoHourlyData
source: No hourly data available
de: Keine stündlichen Daten verfügbar

# deviceDashboardPageNoDistributionData
source: No distribution data available
de: Keine Verteilungsdaten verfügbar

# deviceDashboardPageNoDataSelectedRange
source: No data for selected time range
de: Keine Daten für den ausgewählten Zeitraum verfügbar

source: Assistant Chat
de: Assistenten-Chat

source: Type your message...
de: Geben Sie Ihre Nachricht ein...

# errorInitializingChat
source: Error initializing chat: {error}
de: Fehler beim Initialisieren des Chats: {error}

# failedToGetResponse
source: Failed to get response: {response}
de: Antwort konnte nicht abgerufen werden: {response}

# espConfigTitle
source: ESP Configuration
de: ESP-Konfiguration

# espConfigDescription
source: Configure your ESP device settings below.
de: Konfigurieren Sie unten die Einstellungen Ihres ESP-Geräts.

# espWifiSSIDHint
source: Enter WiFi network name
de: Geben Sie den Namen des WiFi-Netzwerks ein

# espWifiPassword
source: WiFi Password
de: WiFi-Passwort

# espWifiPasswordHint
source: Enter WiFi password
de: Geben Sie das WiFi-Passwort ein

# espSaveSettings
source: Save Settings
de: Einstellungen speichern

# espSetupCameraLater
source: Set up camera later
de: Kamera später einrichten

source: Permissions Required
de: Berechtigungen benötigt

# permissionsBluetoothLocationMessage
source: This app needs Bluetooth and Location permissions to find and connect to cameras. Please grant these permissions to continue.
de: Bluetooth und GPS Berechtigungen werden zum verbinde der Kamera benötigt. Bitte geben sie diese Funktionen frei.

# espSetupCameraLaterExplanation
source: You can either connect a camera now or set it up later
de: Sie können die Kamera sowohl jetzt als auch später einrichten

source: No camera connected
de: Keine Kamera verbunden

source: Save Images
de: Bilder speichern

# saveImagesExplanation
source: Store captured images in device storage
de: Speichere aufgenommene Bilder im Gerätspeicher

source: Motion Triggered
de: Bewegungsauslöser

# motionTriggeredExplanation
source: Capture images when motion is detected
de: Nimmt Bilder auf wenn Bewegung erkannt wird

source: Hours
de: Stunden

source: Minutes
de: Minuten

source: Seconds
de: Sekunden

source: Capture Interval
de: Aufnahme-Intervall

source: Replace
de: Ersetzen

source: Connected Camera
de: Verbundene Kamera

source: Open Settings
de: Einstellungen öffnen

# toContinuePleaseEnable
source: To continue, please enable the following:
de: Um fortzufahren, bitte folgendes anschalten:

source: swipe to assign class
de: Wischen zur Klassifizierung

# dataCollectionMode
source: Data Collection
de: Daten sammeln

# cameraPermissionDenied
source: no Camera Permission
de: Keine Kamera Berechtigung

# testingMode
source: Testing
de: Testen

# quickDataCaptureExplanation
source: Collect Data & Test
de: Daten Sammeln & Testen

# tapToAssignClass
source: Tap to a Assign Class
de: Tippen zum Klassifizieren

# tapOrSwipeToAssign
source: Tap or Swipe to a Assign Class
de: Tippen oder Wischen zum Klassifizieren

source: Test Result
de: Test Resultat

source: Confidence
de: Sicherheit

source: Detected
de: Erkannt

source: Processing Image
de: Verarbeite Bild

# retry
source: reload
de: neu laden

# listeningHint
source: listening...
de: höre zu...

source: Speech Not Available...
de: Sprache nicht verfügbar...

source: Microphone Permission Denied
de: Mikrofon Zugang benötigt

# deviceConfigPageAdvancedSettings
source: Advanced Settings
de: Erweiterte Einstellung

# deviceConfigPageEditDeviceInfo
source: Edit Device Info
de: Geräte Info Bearbeiten

source: no Speech Detected
de: keine Sprache erkannt

source: Test Camera
de: Test Kamera

# testCameraDescription
source: Use your camera to test the inference model
de: Benutze deine Kamera um die KI zu testen

# cameraTesting
source: Test Camera
de: Kamera testen

# deviceConfigPageInferenceMode
source: Inference Mode
de: Ausgabe Modus

source: Notification Settings
de: Benachrichtigungseinstellungen

# notificationSettingsDescription
source: Configure when to receive notifications
de: Konfigurieren Sie, wann Sie Benachrichtigungen erhalten

# notificationConfigTitle
source: Notification Configuration
de: Benachrichtigungskonfiguration

# notificationConfigDescription
source: Configure when to receive notifications for each detected class.
de: Konfigurieren Sie, wann Sie für jede erkannte Klasse Benachrichtigungen erhalten.

source: Count Threshold
de: Anzahlschwellenwert

# locationTrigger
source: Location
de: Standort

# notifyWhenExceedsThreshold
source: Notify when count exceeds threshold:
de: Benachrichtigen, wenn die Anzahl den Schwellenwert überschreitet:

# drawRegionToTrigger
source: Draw region to trigger notification:
de: Zeichnen Sie einen Bereich, um eine Benachrichtigung auszulösen:

source: Save Settings
de: Einstellungen speichern

# settingsSaved
source: Notification settings saved
de: Benachrichtigungseinstellungen gespeichert

# errorSavingSettings
source: Error saving settings: {error}
de: Fehler beim Speichern der Einstellungen: {error}
